-- MySQL dump 10.13  Distrib 8.0.23, for Win64 (x86_64)
--
-- Host: localhost    Database: goods_v1
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `goods`
--

DROP TABLE IF EXISTS `goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods` (
  `ID` int NOT NULL AUTO_INCREMENT,
  `名称` varchar(45) DEFAULT NULL,
  `类型` varchar(45) DEFAULT NULL,
  `库存` int unsigned DEFAULT NULL,
  `售价` decimal(8,2) unsigned DEFAULT NULL,
  `进价` decimal(8,2) unsigned DEFAULT NULL,
  `日期` date DEFAULT NULL,
  `销量` int unsigned DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods`
--

LOCK TABLES `goods` WRITE;
/*!40000 ALTER TABLE `goods` DISABLE KEYS */;
INSERT INTO `goods` VALUES (1,'苹果','水果',2792,1.40,0.20,'2021-03-10',208),(2,'可口可乐','饮品',3797,3.00,1.80,'2021-03-10',1203),(3,'雷姆','工艺品',0,5555.55,888.00,'2021-03-12',1),(4,'扶她奶茶','??限定??',1,188.80,88.00,'2021-03-12',0),(5,'星巴克咖啡','饮品',797,32.00,18.80,'2021-03-11',703),(6,'百岁山矿泉水','饮品',600,3.00,1.80,'2021-03-12',300),(7,'梨','水果',1794,1.20,1.00,'2021-03-13',386),(8,'蟠桃','水果',500,8.80,5.00,'2021-03-13',120),(9,'康师傅冰红茶','饮品',480,3.00,2.50,'2021-03-13',250),(10,'阿萨姆奶茶','饮品',259,4.00,2.80,'2021-03-12',81),(11,'维达纸巾','生活用品',5998,1.00,0.60,'2021-03-13',402),(12,'农夫山泉','饮品',2996,2.00,1.50,'2021-03-11',389),(13,'妙脆角薯片','零食',370,4.50,3.80,'2021-03-12',137),(14,'水蜜桃','水果',500,3.80,2.60,'2021-03-12',87),(15,'猕猴桃','水果',474,5.20,4.10,'2021-03-13',102),(16,'老干妈','调味品',380,9.50,8.50,'2021-03-14',34),(17,'良品猪肉脯','零食',200,18.00,12.00,'2021-03-14',18),(18,'大白兔奶糖','零食',800,2.00,1.00,'2021-03-12',150),(19,'希诺保温杯','日用品',100,200.00,150.00,'2021-03-11',1),(20,'电蚊拍','日用品',80,68.00,38.00,'2021-03-14',5),(21,'牙刷','日用品',89,5.00,2.50,'2021-03-11',8),(22,'中华牌香烟','香烟',100,98.00,80.00,'2021-03-14',5),(23,'葵花牌瓜子','零食',154,10.50,8.00,'2021-03-12',126),(24,'AD钙','饮品',260,2.50,2.00,'2021-03-12',38),(25,'酱油','调味品',80,6.50,4.50,'2021-03-13',60),(26,'塑料随身水杯','日用品',200,35.00,18.00,'2021-03-13',0),(27,'雪碧','饮品',800,2.50,1.80,'2021-03-13',0),(28,'樱桃','水果',500,12.80,6.80,'2021-03-13',0),(29,'超级棒棒糖','零食',80,5.00,2.00,'2021-03-13',0),(30,'俄罗斯紫皮糖','零食',189,28.00,18.00,'2021-03-13',11),(31,'立白洗衣液','日用品',80,28.00,18.00,'2021-03-13',0),(32,'拖鞋','日用品',186,18.50,9.50,'2021-03-13',0),(33,'越景陈年花雕酒','饮品',122,145.00,85.00,'2021-03-13',1),(34,'越景花雕酒','饮品',131,456.00,300.00,'2021-03-13',1),(35,'古越龙山绍兴酒','饮品',166,161.00,80.00,'2021-03-13',0),(36,'会稽山陈酿黄酒','饮品',464,165.00,90.00,'2021-03-13',1),(37,'五粮液1618','饮品',389,48.00,30.00,'2021-03-13',76),(38,'金六福50度白酒','饮品',468,446.00,356.00,'2021-03-13',0),(39,'老窖52度白酒','饮品',456,168.00,128.00,'2021-03-13',0),(40,'旺仔牛奶(纸盒）','饮品',100,5.00,3.00,'2021-03-13',20),(41,'蒙牛奶核桃味','饮品',165,4.00,2.80,'2021-03-13',0),(42,'特仑苏纯牛奶','饮品',165,6.00,3.80,'2021-03-13',0),(43,'营养快线菠萝味','饮品',3135,4.50,3.00,'2021-03-13',0),(44,'达能饼干香橙味','零食',56,52.50,35.60,'2021-03-13',0),(45,'欣欣杯朱古力','零食',1513,15.00,5.00,'2021-03-13',3),(46,'达能清甜饼干','零食',54,5.60,3.00,'2021-03-13',0),(47,'四洲小欣欣杯','零食',15,2.30,1.80,'2021-03-13',1),(48,'小馒头','零食',0,2.00,1.00,'2021-03-13',12),(49,'可比克薯片','零食',4,21.00,11.00,'2021-03-13',8),(50,'好丽友番茄薯片','零食',122,22.00,15.00,'2021-03-13',0),(51,'好丽友牛排薯条','零食',1432,23.00,11.00,'2021-03-13',0),(52,'汰渍柠檬洗衣皂','日用品',9,13.00,5.00,'2021-03-13',3),(53,'薰衣草柔顺剂','日用品',50,13.00,7.00,'2021-03-13',2),(54,'奥妙净蓝洗衣粉','日用品',2155,15.00,5.00,'2021-03-13',10),(55,'奥妙超效洗衣皂','日用品',263,43.00,29.00,'2021-03-13',2),(56,'雕牌加酶洗衣粉','日用品',5161,51.00,37.00,'2021-03-13',0),(57,'去渍柠檬洗衣粉','日用品',22,17.00,13.00,'2021-03-13',0),(58,'大号印花果汁杯','日用品',216,24.00,18.00,'2021-03-13',0),(59,'汇丰有盖口杯','日用品',37,45.00,28.00,'2021-03-13',4),(60,'霸吸水壶','日用品',4565,128.00,68.00,'2021-03-13',0),(61,'汇源果汁','饮品',443,3.50,2.50,'2021-03-16',7),(62,'酸奶','饮品',101,8.00,4.50,'2021-03-17',22),(63,'花花牛酸奶','饮品',83,3.50,2.00,'2021-03-20',17),(64,'纯甄酸奶','饮品',3,8.00,5.00,'2021-03-20',47),(65,'特朗普玩偶','玩具',0,199.00,99.00,'2021-03-22',1),(66,'充电宝','日用品',97,79.00,59.00,'2021-03-22',3);
/*!40000 ALTER TABLE `goods` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-10-30 19:12:20
